# FlowState Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..FlowState Property
MEPNetworkSegmentData Class See Also
---
The calculated flow state of this segment.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public PipeFlowState FlowState { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FlowState As PipeFlowState
	Get
```

Visual C++
---
```text
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace